[
  {
    "path": "posts/2024-08-01-dondpart1/",
    "title": "Deal or No Deal | Part 1: Beating the Banker",
    "description": "Everyone has heard of Deal or No Deal, but how does the show actually work? And more importantly, is it actually possible to \"Beat the Banker\"?",
    "author": [],
    "date": "2024-08-01",
    "categories": [],
    "contents": "\n\nContents\nWhat is Deal or No Deal?\nHow should Deal or No Deal be played?\nHow do the offers in Deal or No Deal work?\nSo, can we “Beat the Banker”?\n\n\n\nWhat is Deal or No Deal?\nYou’re probably aware of the TV gameshow Deal or No Deal – since its launch in 2005, it has been licensed in 80 different countries, airing over 600 episodes of the original US version alone. For those who need a reminder, in Deal or No Deal, a contestant is offered a selection of 26 briefcases each containing a different amount of money ranging from a single cent all the way up to 1 million dollars. Over the course of the game, they play a series of rounds in which they open some of the briefcases, eliminating those cases from the game. At the end of each round, “The Banker” offers the contestant a guaranteed cash value to quit the game. If the contestant declines, the game continues until only one case remains and the contestant wins the amount in that case.\nIt’s an incredibly simple format, but it also involves a series of crucial decisions all centred around the question:\n\nHow much should you be willing to accept from The Banker?\n\n\nIn this series of posts, I’ll be using a dataset of over 145 games1 of Deal or No Deal to explore the mechanics of the TV game show. In part 1, I’ll explore how the mysterious Banker produces their offers for the contestants to either accept or reject. In part 2, I’ll examine how those contestants make their decisions. And in part 3, I’ll use all of those insights to design the ultimate Banker.\nHow should Deal or No Deal be played?\nOn first consideration, the solution to Deal or No Deal is quite simple: you should never accept any offer that is less than the Expected Value of the remaining cases. When we say Expected Value, what we mean is the average amount in each of the remaining cases. For example, if you had two cases remaining, the 1-cent case and the 1 million dollar case, you should not be willing to accept anything less than $500,000 from The Banker because, on average, that is the amount that you will win.\nThe predicament, however, is that The Banker (i.e., the showrunners) also understands Expected Value and adjusts their offers accordingly. To really optimize our strategy, we’ll have to better understand how these offers are formulated…\nHow do the offers in Deal or No Deal work?\nBelow, I’ve plotted the offers made by The Banker in nearly 1000 rounds of Deal or No Deal played in three different countries2. The solid diagonal line indicates parity between the Expected Value and The Banker’s offer. You’ll notice that the offers are extremely variable, but almost never rise above the Expected Value.\n\n\n\nTo understand these offers, we first have to understand the motives of the showrunners. To make the show entertaining (and fill the 44-minute runtime), they do not want contestants to accept the first offer they receive. To make sure of this, they make the first offer extremely low. In fact, for the 225 contestants we are analyzing, the first round offer was an average of 8.52% of the Expected Value.\nHowever, it is also in the showrunners’ interests that not every contestant goes to the final round; there need to be some difficult decisions and suspense. To make sure of this, The Banker’s offer gets closer to the Expected Value with every round that passes. This is best demonstrated visually – let’s plot the offers again, but this time, we’ll give each offer a colour corresponding to the round in which it was made. You can use the legend to toggle each round on/off.\n\n\n\n\n\nNow we can start to see a trend emerging! The early-round offers are well below the line of parity, but as we get closer to round 9 (the final round) those offers start to approach the Expected Value of the remaining cases.\nWe can do a bit better than this, though – how exactly does The Banker determine what proportion of the Expected Value to offer each round? One suggestion made by Post et al. (2008) is that the offer for each round is a proportion (\\(b_r\\)) of the Expected Value that takes the proportion offered on the previous round (\\(b_{r-1}\\)) and increases it in progressively smaller steps until the final round is reached:\n\\[\\begin{equation}\n\\tag{1}\nb_r = b_{r-1} + (1 - b_{r-1})\\cdot\\rho^{9-(r-1)}\n\\end{equation}\\]\nHere, \\(0 < \\rho < 1\\) dictates the rate at which the proportion offered changes – the closer \\(\\rho\\) is to 1, the quicker the offers will approach 100% of the Expected Value…\nThere’s quite a strong assumption baked into this – that the proportion of the Expected Value offered each round is dependent on the proportion offered in the previous round. It’s equally plausible that, instead, the proportion offered follows a set trajectory, with random noise added independently each round. Post et al. don’t directly address this assumption, so we’ll have to do some digging of our own.\nBelow is the correlation between the proportion of the Expected Value offered in round \\(r\\) and the proportion of the Expected Value offered in the preceding round \\(r-1\\). To prevent scaling issues, I’ve z-scored the proportions in each round. If the offer is dependent on the previous round, there will be a positive correlation…\n\n\n\n…and that’s exactly what we see. Great! Let’s adopt Equation 1 from the Post et al. and replicate their results.\nIf we treat our data hierarchically, each country in our dataset produces a slightly different \\(\\rho\\) estimate. The US edition has a \\(\\rho\\) of 0.778, in the German edition, \\(\\rho =\\) 0.775, while in the Dutch, \\(\\rho =\\) 0.804.\nIgnoring the hierarchical structure, we get an aggregated estimate of \\(\\rho = .787\\). Let’s see how these estimates map onto our data. Here, we have the aggregate model predictions for each round shown as dashed lines. The predictions here clearly illustrate how the model correctly increases its predicted offers as the rounds progress.\n\n\n\nSo, can we “Beat the Banker”?\nLet’s summarize what we’ve learned so far…\nThe Banker’s offers are somewhat predictable. Each round, The Banker’s offer is some proportion of the Expected Value of the remaining cases. The offers seem to have some variability, whether through the addition of random noise or deliberate decisions made by the showrunners.\nConsecutive offers are not independent. The exact proportion of the Expected Value offered is a function of the proportion offered last round. That proportion increases as the rounds progress, starting with large increases before steadily plateauing.\n\nSo, what does this mean for us beating The Banker?\n\n\nWell, there are a few takeaway points:\n\n\nThe offers you get in the first few rounds will generally be terrible. The Banker’s early offers will be extreme lowballs that should be easily rejected.\nThe Banker will almost never offer you above the Expected Value of the remaining cases. You won’t be getting your money’s worth from The Banker until the very final rounds.\nGiven The Banker is almost never going to offer you the true value of your case: Does this mean that it is right for everyone to simply reject every offer and play until the final round? Well… not quite. While this strategy will earn you the biggest win on average, there will be a lot more variability in the final outcome than if you accept an earlier offer.\nTo quickly illustrate this, I’ve plotted the distributions of possible outcomes in each round of a game3. I’ve multiplied each outcome by the average proportion of the Expected Value offered by The Banker to illustrate how the offers evolve over the course of the game. You will notice that the average offer creeps up in the later rounds, as The Banker starts to make offers approaching the true Expected Value. However, the median offer starts to decrease in later rounds as the distribution skews to the right, leaving a higher chance of a very small offer than in round 4, for example…\n\n\n\nSo, it’s really up to the player to determine whether the higher average rewards available in later rounds are worth the additional variability in rewards!\nOnce we get past the idea of “Beating The Banker”, the question of whether an offer is subjectively substantial enough for you to accept it is a much more interesting one. It starts to invoke core principles of modern behavioural economics and decision science that allow this relatively simple game to produce its trademark difficult decisions.\nIn the next post, we’ll explore how the contestants make their decisions about whether to accept an offer.\n\n\n\nPost, Thierry, Martijn J van den Assem, Guido Baltussen, and Richard H Thaler. 2008. “Deal or No Deal? Decision Making Under Risk in a Large-Payoff Game Show.” American Economic Review 98 (March): 38–71. https://doi.org/10.1257/aer.98.1.38.\n\n\nThe data used in this post is licensed under the Creative Commons Attribution 4.0 International License. Modifications were made to the original materials for analysis purposes. Credit for this dataset should be given to the original authors: Thierry Post, Martijn van den Assem, Guido Baltussen, and Richard Thaler, and to the American Economic Association. The full dataset is available here.↩︎\nHere we’re working with data from the US, German, and Dutch editions of the show. For the sake of plotting, I’ve transformed the data from the European versions to dollar amounts peaking at 1 million dollars.↩︎\nI’m using the case values from the US edition here – the cases in the European editions are slightly different, but the same general principles apply.↩︎\n",
    "preview": "posts/2024-08-01-dondpart1/DoND_case2.png",
    "last_modified": "2024-08-14T21:17:51-04:00",
    "input_file": {},
    "preview_width": 1792,
    "preview_height": 1024
  }
]
